Долома/src/Documents/Взвешивание/Взвешивание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Взвешивание</name>
  <registerRecords>InformationRegister.Взвешивания</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ферма</name>
    <type>
      <types>CatalogRef.Фермы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Животные</name>
    <attributes>
      <name>Животное</name>
      <type>
        <types>CatalogRef.Животные</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Рост</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СреднеСуточныйПривес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрошлыйВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазницаВВесе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Долома/src/InformationRegisters/Взвешивания/Взвешивания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Взвешивания</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Вес</name>
    <comment>Вес на перевеске (в кг)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Рост</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СреднеСуточныйПривес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесТриМесяца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Животное</name>
    <type>
      <types>CatalogRef.Животные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/Documents/Взвешивание/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Взвешивания.Записывать = Истина;
	
	Для каждого СтрокаТабличнойЧасти Из Животные Цикл
		
		НовоеДвижение 						= Движения.Взвешивания.Добавить();
		НовоеДвижение.Вес	 				= СтрокаТабличнойЧасти.Вес;
		НовоеДвижение.Животное 				= СтрокаТабличнойЧасти.Животное;
		НовоеДвижение.Период 				= Дата;
		НовоеДвижение.Примечание			= СтрокаТабличнойЧасти.Примечание;
		НовоеДвижение.Рост					= СтрокаТабличнойЧасти.Рост;
		НовоеДвижение.СреднеСуточныйПривес 	= СтрокаТабличнойЧасти.СреднеСуточныйПривес;
		
	КонецЦикла;
	
КонецПроцедуры
